package lesson_09__10_10_24_Methods_PeregruzkaMetoda_TernaryOperator.homework;

/*                                   Home Work 0
                                       Task 0
Написать метод, принимающий на вход строку. Метод должен вывести на экран число, соответсвующее количеству символов в строке.
Например: Если в метод пришла строка "hello" - метод должен вывести число 5 (так как в строке hello 5 символов)
 */
public class NW_09_Task0_MthodString {
    public static void main(String[] args) {

        String hello = "Hello";
        System.out.println("Длина строки < Hello > - " + hello.length() + " символов!");

    }

    // Решение кода от учителя

}
