package lesson29__19_12_24_equals.homework29;
/*
ВАЖНО!
На следующей неделе мы начинаем работу над первым проектом.
Работа над проектом будет проходить во время, отведенное под лекции.
Работать над проектом можно будет только в мини-командах 3-4 человека (минимум 3 человека)
До 21.00 понедельника 6 января мне от вас нужен список студентов, которые смогут принимать активное участие в работе над проектом
Крайне желательно, чтобы вы распределились по командам.
P.S. чуть позже дам ссылку на таблицу для распределения по командам
 */

public class Task {
}
