package lesson_17__07_11_24_Incapsulation.homework_17;
/*
Task 0
Написать класс Employee (Работник)

У него должны быть поля имя, возраст, зарплата

Инкапсулировать класс.

Написать метод info() выводящий информацию о работнике.


Task 1
Инкапсулировать класс нашего магического массива


Task 2 * (Опционально)
Написать метод int lastIndexOf(int value) возвращающий индекс последнего
вхождения значения в массиве.
Написать метод int[] toArray() возвращающий все значения в виде обычного массива
 */
public class HW17_Task {
}
