package lesson_13_24_10_24_GitHub.homework13;
/*
Task 1
Создать локальный репозиторий git, который будет отслеживать состоянии вашего проекта (там где вы пишете код уроков и домашние задания)
Создать удаленный репозиторий на GitHub
Синхронизировать локальный и удаленный репозиторий
Прислать мне ссылку на репозиторий с проектом
P.S. Если по какой-то причине вы пишете домашние работы и код на лекциях в двух разных проектах - создать два репозитория и прислать 2 ссылки
 */
public class Task13 {
    public static void main(String[] args) {

    }
}
