package lesson16__05_11_24_MagicArray_OOP_Constructor;
/*
Можно сделать на выбор 1 или 2 задачу.
Task 1
Создайте абстрактный класс Shape (Форма) с абстрактными методами для вычисления площади и периметра.
Реализуйте классы-наследники Circle (Круг), Rectangle (Прямоугольник), и Triangle (Треугольник).
Убедитесь, что все классы правильно вычисляют площадь и периметр.
Создайте массив объектов Shape и вычислите общую площадь и периметр всех фигур в массиве.

Task 2
Создайте абстрактный класс GameCharacter, который представляет базовый класс для игровых персонажей.
Определите абстрактный метод attack(), который будет различаться для разных типов персонажей (например, воин
атакует мечом, а маг использует магические заклинания).
Создайте несколько конкретных подклассов, представляющих разные типы персонажей, такие как
Warrior, Mage, Archer, и т. д.
Переопределите метод attack() для каждого класса.
Создайте массив из игровых персонажей разных типов. Вызовите у каждого метод attack() в цикле.
 */
public class Task23 {
}
