package lesson11_17_10_24_Null__Continue_01_43.homework;
/*
Task 1
Написать метод, который считает сумму всех элементов в массиве.

Task 2
Написать метод, который находит среднее значение элементов в массиве (среднее арифметическое).

Task 3 * (Опционально)
Написать метод, который проверяет, является ли массив палиндромом (читается одинаково с обоих концов).

Task 4 * (Опционально)
Написать метод, который удаляет все вхождения заданного числа из массива и возвращает новый массив без этого числа.
 */

public class HW11_Task {
}
