package lesson_03_peremennie_tipydannih.homework_03;
/*
Task 1
В классе HomeWork03 задекларировать (объявить) и присвоить значения 3-м переменным. Правильно подберите тип и имя переменным.

Переменная 1 - сколько Вам полных лет
Переменная 2 - должна хранить стоимость 1 литра молока в Вашей стране (без наименования валюты - только цена)
Переменная 3 - Ваше имя (Опционально, так как мы с вами не учили, в каком типе данных хранить можно хранить текст. (Гугл?))
 */

public class HW_Task_1 {
    public static void main(String[] args) {

        int age = 50;// возраст
        double costOfMilk = 1.65; // Стоимость 1 литра молока
        String name = "Anatoli";// Имя

    }
}
